echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l152k4.h
#define BEEP_CSR1_MSR            BEEP_CSR1_bit.MSR

#define BEEP_CSR2_BEEPDIV        BEEP_CSR2_bit.BEEPDIV
#define BEEP_CSR2_BEEPEN         BEEP_CSR2_bit.BEEPEN
#define BEEP_CSR2_BEEPSEL        BEEP_CSR2_bit.BEEPSEL

#endif

/*-------------------------------------------------------------------------
 *      BEEP bit masks
 *-----------------------------------------------------------------------*/
#define MASK_BEEP_CSR1_MSR       0x01

#define MASK_BEEP_CSR2_BEEPDIV   0x1F
#define MASK_BEEP_CSR2_BEEPEN    0x20
#define MASK_BEEP_CSR2_BEEPSEL   0xC0


/*-------------------------------------------------------------------------
 *      RTC register definitions
 *-----------------------------------------------------------------------*/
/* Time register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SU          : 4;
  unsigned char ST          : 4;
} __BITS_RTC_TR1;
#endif
__IO_REG8_BIT(RTC_TR1,     0x5140, __READ_WRITE, __BITS_RTC_TR1);

/* Time register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MNU         : 4;
  unsigned char MNT         : 4;
} __BITS_RTC_TR2;
#endif
__IO_REG8_BIT(RTC_TR2,     0x5141, __READ_WRITE, __BITS_RTC_TR2);

/* Time register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HU          : 4;
  unsigned char HT          : 2;
  unsigned char PM          : 1;
} __BITS_RTC_TR3;
#endif
__IO_REG8_BIT(RTC_TR3,     0x5142, __READ_WRITE, __BITS_RTC_TR3);

/* Date register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DU          : 4;
  unsigned char DT          : 2;
} __BITS_RTC_DR1;
#endif
__IO_REG8_BIT(RTC_DR1,     0x5144, __READ_WRITE, __BITS_RTC_DR1);

/* Date register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MU          : 4;
  unsigned char MT          : 1;
  unsigned char WDU         : 3;
} __BITS_RTC_DR2;
#endif
__IO_REG8_BIT(RTC_DR2,     0x5145, __READ_WRITE, __BITS_RTC_DR2);

/* Date register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char YU          : 4;
  unsigned char YT          : 4;
} __BITS_RTC_DR3;
#endif
__IO_REG8_BIT(RTC_DR3,     0x5146, __READ_WRITE, __BITS_RTC_DR3);

/* Control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WUCKSEL     : 4;
  unsigned char             : 1;
  unsigned char RATIO       : 1;
  unsigned char FMT         : 1;
} __BITS_RTC_CR1;
#endif
__IO_REG8_BIT(RTC_CR1,     0x5148, __READ_WRITE, __BITS_RTC_CR1);

/* Control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALRAE       : 1;
  unsigned char             : 1;
  unsigned char WUTE        : 1;
  unsigned char             : 1;
  unsigned char ALRAIE      : 1;
  unsigned char             : 1;
  unsigned char WUTIE       : 1;
} __BITS_RTC_CR2;
#endif
__IO_REG8_BIT(RTC_CR2,     0x5149, __READ_WRITE, __BITS_RTC_CR2);

/* Control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD1H       : 1;
  unsigned char SUB1H       : 1;
  unsigned char BCK         : 1;
  unsigned char             : 1;
  unsigned char POL         : 1;
  unsigned char OSEL        : 2;
  unsigned char COE         : 1;
} __BITS_RTC_CR3;
#endif
__IO_REG8_BIT(RTC_CR3,     0x514A, __READ_WRITE, __BITS_RTC_CR3);

/* Initialization and status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALRAWF      : 1;
  unsigned char RECALPF     : 1;
  unsigned char WUTWF       : 1;
  unsigned char SHPF        : 1;
  unsigned char INITS       : 1;
  unsigned char RSF         : 1;
  unsigned char INITF       : 1;
  unsigned char INIT        : 1;
} __BITS_RTC_ISR1;
#endif
__IO_REG8_BIT(RTC_ISR1,    0x514C, __READ_WRITE, __BITS_RTC_ISR1);

/* Initialization and Status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALRAF       : 1;
  unsigned char             : 1;
  unsigned char WUTF        : 1;
  unsigned char             : 2;
  unsigned char TAMP1F      : 1;
  unsigned char TAMP2F      : 1;
  unsigned char TAMP3F      : 1;
} __BITS_RTC_ISR2;
#endif
__IO_REG8_BIT(RTC_ISR2,    0x514D, __READ_WRITE, __BITS_RTC_ISR2);

/* Synchronous prescaler register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PREDIV_S8   : 1;
  unsigned char PREDIV_S9   : 1;
  unsigned char PREDIV_S10  : 1;
  unsigned char PREDIV_S11  : 1;
  unsigned char PREDIV_S12  : 1;
} __BITS_RTC_SPRERH;
#endif
__IO_REG8_BIT(RTC_SPRERH,  0x5150, __READ_WRITE, __BITS_RTC_SPRERH);

/* Synchronous prescaler register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PREDIV_S0   : 1;
  unsigned char PREDIV_S1   : 1;
  unsigned char PREDIV_S2   : 1;
  unsigned char PREDIV_S3   : 1;
  unsigned char PREDIV_S4   : 1;
  unsigned char PREDIV_S5   : 1;
  unsigned char PREDIV_S6   : 1;
  unsigned char PREDIV_S7   : 1;
} __BITS_RTC_SPRERL;
#endif
__IO_REG8_BIT(RTC_SPRERL,  0x5151, __READ_WRITE, __BITS_RTC_SPRERL);

/* Asynchronous prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PREDIV_A    : 7;
} __BITS_RTC_APRER;
#endif
__IO_REG8_BIT(RTC_APRER,   0x5152, __READ_WRITE, __BITS_RTC_APRER);

/* Wakeup timer register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WUT8        : 1;
  unsigned char WUT9        : 1;
  unsigned char WUT10       : 1;
  unsigned char WUT11       : 1;
  unsigned char WUT12       : 1;
  unsigned char WUT13       : 1;
  unsigned char WUT14       : 1;
  unsigned char WUT15       : 1;
} __BITS_RTC_WUTRH;
#endif
__IO_REG8_BIT(RTC_WUTRH,   0x5154, __READ_WRITE, __BITS_RTC_WUTRH);

/* Wakeup timer register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WUT0        : 1;
  unsigned char WUT1        : 1;
  unsigned char WUT2        : 1;
  unsigned char WUT3        : 1;
  unsigned char WUT4        : 1;
  unsigned char WUT5        : 1;
  unsigned char WUT6        : 1;
  unsigned char WUT7        : 1;
} __BITS_RTC_WUTRL;
#endif
__IO_REG8_BIT(RTC_WUTRL,   0x5155, __READ_WRITE, __BITS_RTC_WUTRL);

/* Write protection register */
__IO_REG8    (RTC_WPR,     0x5159, __READ_WRITE);
/* Alarm A register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALSU        : 4;
  unsigned char ALST        : 3;
  unsigned char MSK1        : 1;
} __BITS_RTC_ALRMAR1;
#endif
__IO_REG8_BIT(RTC_ALRMAR1, 0x515C, __READ_WRITE, __BITS_RTC_ALRMAR1);

/* Alarm A register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALMNU       : 4;
  unsigned char ALMNT       : 3;
  unsigned char MSK2        : 1;
} __BITS_RTC_ALRMAR2;
#endif
__IO_REG8_BIT(RTC_ALRMAR2, 0x515D, __READ_WRITE, __BITS_RTC_ALRMAR2);

/* Alarm A register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALHU        : 4;
  unsigned char ALHT        : 2;
  unsigned char PM          : 1;
  unsigned char MSK3        : 1;
} __BITS_RTC_ALRMAR3;
#endif
__IO_REG8_BIT(RTC_ALRMAR3, 0x515E, __READ_WRITE, __BITS_RTC_ALRMAR3);

/* Alarm A register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALDU        : 4;
  unsigned char ALDT        : 2;
  unsigned char WDSEL       : 1;
  unsigned char MSK4        : 1;
} __BITS_RTC_ALRMAR4;
#endif
__IO_REG8_BIT(RTC_ALRMAR4, 0x515F, __READ_WRITE, __BITS_RTC_ALRMAR4);


/*-------------------------------------------------------------------------
 *      RTC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

