echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l152k4.h
/* TIM1 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
  unsigned char CC3OF       : 1;
  unsigned char CC4OF       : 1;
} __BITS_TIM1_SR2;
#endif
__IO_REG8_BIT(TIM1_SR2,    0x52B7, __READ_WRITE, __BITS_TIM1_SR2);

/* TIM1 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char CC3G        : 1;
  unsigned char CC4G        : 1;
  unsigned char COMG        : 1;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM1_EGR;
#endif
__IO_REG8_BIT(TIM1_EGR,    0x52B8, __WRITE, __BITS_TIM1_EGR);

/* TIM1 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
  unsigned char OC1CE       : 1;
} __BITS_TIM1_CCMR1;
#endif
__IO_REG8_BIT(TIM1_CCMR1,  0x52B9, __READ_WRITE, __BITS_TIM1_CCMR1);

/* TIM1 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
  unsigned char OC2CE       : 1;
} __BITS_TIM1_CCMR2;
#endif
__IO_REG8_BIT(TIM1_CCMR2,  0x52BA, __READ_WRITE, __BITS_TIM1_CCMR2);

/* TIM1 Capture/Compare mode register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3S        : 2;
  unsigned char OC3FE       : 1;
  unsigned char OC3PE       : 1;
  unsigned char OC3M        : 3;
  unsigned char OC3CE       : 1;
} __BITS_TIM1_CCMR3;
#endif
__IO_REG8_BIT(TIM1_CCMR3,  0x52BB, __READ_WRITE, __BITS_TIM1_CCMR3);

/* TIM1 Capture/Compare mode register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC4S        : 2;
  unsigned char             : 1;
  unsigned char OC4PE       : 1;
  unsigned char OC4M        : 3;
  unsigned char OC4CE       : 1;
} __BITS_TIM1_CCMR4;
#endif
__IO_REG8_BIT(TIM1_CCMR4,  0x52BC, __READ_WRITE, __BITS_TIM1_CCMR4);

/* TIM1 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char CC1NE       : 1;
  unsigned char CC1NP       : 1;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
  unsigned char CC2NE       : 1;
  unsigned char CC2NP       : 1;
} __BITS_TIM1_CCER1;
#endif
__IO_REG8_BIT(TIM1_CCER1,  0x52BD, __READ_WRITE, __BITS_TIM1_CCER1);

/* TIM1 Capture/Compare enable register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3E        : 1;
  unsigned char CC3P        : 1;
  unsigned char CC3NE       : 1;
  unsigned char CC3NP       : 1;
  unsigned char CC4E        : 1;
  unsigned char CC4P        : 1;
} __BITS_TIM1_CCER2;
#endif
__IO_REG8_BIT(TIM1_CCER2,  0x52BE, __READ_WRITE, __BITS_TIM1_CCER2);

/* TIM1 counter high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT8        : 1;
  unsigned char CNT9        : 1;
  unsigned char CNT10       : 1;
  unsigned char CNT11       : 1;
  unsigned char CNT12       : 1;
  unsigned char CNT13       : 1;
  unsigned char CNT14       : 1;
  unsigned char CNT15       : 1;
} __BITS_TIM1_CNTRH;
#endif
__IO_REG8_BIT(TIM1_CNTRH,  0x52BF, __READ_WRITE, __BITS_TIM1_CNTRH);

/* TIM1 counter low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT0        : 1;
  unsigned char CNT1        : 1;
  unsigned char CNT2        : 1;
  unsigned char CNT3        : 1;
  unsigned char CNT4        : 1;
  unsigned char CNT5        : 1;
  unsigned char CNT6        : 1;
  unsigned char CNT7        : 1;
} __BITS_TIM1_CNTRL;
#endif
__IO_REG8_BIT(TIM1_CNTRL,  0x52C0, __READ_WRITE, __BITS_TIM1_CNTRL);

/* TIM1 prescaler register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC8        : 1;
  unsigned char PSC9        : 1;
  unsigned char PSC10       : 1;
  unsigned char PSC11       : 1;
  unsigned char PSC12       : 1;
  unsigned char PSC13       : 1;
  unsigned char PSC14       : 1;
  unsigned char PSC15       : 1;
} __BITS_TIM1_PSCRH;
#endif
__IO_REG8_BIT(TIM1_PSCRH,  0x52C1, __READ_WRITE, __BITS_TIM1_PSCRH);

/* TIM1 prescaler register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC0        : 1;
  unsigned char PSC1        : 1;
  unsigned char PSC2        : 1;
  unsigned char PSC3        : 1;
  unsigned char PSC4        : 1;
  unsigned char PSC5        : 1;
  unsigned char PSC6        : 1;
  unsigned char PSC7        : 1;
} __BITS_TIM1_PSCRL;
#endif
__IO_REG8_BIT(TIM1_PSCRL,  0x52C2, __READ_WRITE, __BITS_TIM1_PSCRL);

/* TIM1 Auto-reload register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR8        : 1;
  unsigned char ARR9        : 1;
  unsigned char ARR10       : 1;
  unsigned char ARR11       : 1;
  unsigned char ARR12       : 1;
  unsigned char ARR13       : 1;
  unsigned char ARR14       : 1;
  unsigned char ARR15       : 1;
} __BITS_TIM1_ARRH;
#endif
__IO_REG8_BIT(TIM1_ARRH,   0x52C3, __READ_WRITE, __BITS_TIM1_ARRH);

/* TIM1 Auto-reload register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR0        : 1;
  unsigned char ARR1        : 1;
  unsigned char ARR2        : 1;
  unsigned char ARR3        : 1;
  unsigned char ARR4        : 1;
  unsigned char ARR5        : 1;
  unsigned char ARR6        : 1;
  unsigned char ARR7        : 1;
} __BITS_TIM1_ARRL;
#endif
__IO_REG8_BIT(TIM1_ARRL,   0x52C4, __READ_WRITE, __BITS_TIM1_ARRL);

/* TIM1 Repetition counter register */
__IO_REG8    (TIM1_RCR,    0x52C5, __READ_WRITE);
/* TIM1 Capture/Compare register 1 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR18       : 1;
  unsigned char CCR19       : 1;
  unsigned char CCR110      : 1;
  unsigned char CCR111      : 1;
  unsigned char CCR112      : 1;
  unsigned char CCR113      : 1;
  unsigned char CCR114      : 1;
  unsigned char CCR115      : 1;
} __BITS_TIM1_CCR1H;
#endif
__IO_REG8_BIT(TIM1_CCR1H,  0x52C6, __READ_WRITE, __BITS_TIM1_CCR1H);

/* TIM1 Capture/Compare register 1 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM1_CCR1L;
#endif
__IO_REG8_BIT(TIM1_CCR1L,  0x52C7, __READ_WRITE, __BITS_TIM1_CCR1L);

/* TIM1 Capture/Compare register 2 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR28       : 1;
  unsigned char CCR29       : 1;
  unsigned char CCR210      : 1;
  unsigned char CCR211      : 1;
  unsigned char CCR212      : 1;
  unsigned char CCR213      : 1;
  unsigned char CCR214      : 1;
  unsigned char CCR215      : 1;
} __BITS_TIM1_CCR2H;
#endif
__IO_REG8_BIT(TIM1_CCR2H,  0x52C8, __READ_WRITE, __BITS_TIM1_CCR2H);

/* TIM1 Capture/Compare register 2 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR20       : 1;
  unsigned char CCR21       : 1;
  unsigned char CCR22       : 1;
  unsigned char CCR23       : 1;
  unsigned char CCR24       : 1;
  unsigned char CCR25       : 1;
  unsigned char CCR26       : 1;
  unsigned char CCR27       : 1;
} __BITS_TIM1_CCR2L;
#endif
__IO_REG8_BIT(TIM1_CCR2L,  0x52C9, __READ_WRITE, __BITS_TIM1_CCR2L);

/* TIM1 Capture/Compare register 3 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR38       : 1;
  unsigned char CCR39       : 1;
  unsigned char CCR310      : 1;
  unsigned char CCR311      : 1;
  unsigned char CCR312      : 1;
  unsigned char CCR313      : 1;
  unsigned char CCR314      : 1;
  unsigned char CCR315      : 1;
} __BITS_TIM1_CCR3H;
#endif
__IO_REG8_BIT(TIM1_CCR3H,  0x52CA, __READ_WRITE, __BITS_TIM1_CCR3H);

