echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l152k4.h
/* TIM1 Capture/Compare register 3 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR30       : 1;
  unsigned char CCR31       : 1;
  unsigned char CCR32       : 1;
  unsigned char CCR33       : 1;
  unsigned char CCR34       : 1;
  unsigned char CCR35       : 1;
  unsigned char CCR36       : 1;
  unsigned char CCR37       : 1;
} __BITS_TIM1_CCR3L;
#endif
__IO_REG8_BIT(TIM1_CCR3L,  0x52CB, __READ_WRITE, __BITS_TIM1_CCR3L);

/* TIM1 Capture/Compare register 4 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR48       : 1;
  unsigned char CCR49       : 1;
  unsigned char CCR410      : 1;
  unsigned char CCR411      : 1;
  unsigned char CCR412      : 1;
  unsigned char CCR413      : 1;
  unsigned char CCR414      : 1;
  unsigned char CCR415      : 1;
} __BITS_TIM1_CCR4H;
#endif
__IO_REG8_BIT(TIM1_CCR4H,  0x52CC, __READ_WRITE, __BITS_TIM1_CCR4H);

/* TIM1 Capture/Compare register 4 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR40       : 1;
  unsigned char CCR41       : 1;
  unsigned char CCR42       : 1;
  unsigned char CCR43       : 1;
  unsigned char CCR44       : 1;
  unsigned char CCR45       : 1;
  unsigned char CCR46       : 1;
  unsigned char CCR47       : 1;
} __BITS_TIM1_CCR4L;
#endif
__IO_REG8_BIT(TIM1_CCR4L,  0x52CD, __READ_WRITE, __BITS_TIM1_CCR4L);

/* TIM1 break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char OSSR        : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM1_BKR;
#endif
__IO_REG8_BIT(TIM1_BKR,    0x52CE, __READ_WRITE, __BITS_TIM1_BKR);

/* TIM1 dead-time register */
__IO_REG8    (TIM1_DTR,    0x52CF, __READ_WRITE);
/* TIM1 output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char OIS1N       : 1;
  unsigned char OIS2        : 1;
  unsigned char OIS2N       : 1;
  unsigned char OIS3        : 1;
  unsigned char OIS3N       : 1;
} __BITS_TIM1_OISR;
#endif
__IO_REG8_BIT(TIM1_OISR,   0x52D0, __READ_WRITE, __BITS_TIM1_OISR);

/* DMA1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DBA         : 5;
} __BITS_TIM1_DCR1;
#endif
__IO_REG8_BIT(TIM1_DCR1,   0x52D1, __READ_WRITE, __BITS_TIM1_DCR1);

/* TIM1 DMA1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DBL         : 5;
} __BITS_TIM1_DCR2;
#endif
__IO_REG8_BIT(TIM1_DCR2,   0x52D2, __READ_WRITE, __BITS_TIM1_DCR2);

/* TIM1 DMA1 address for burst mode */
__IO_REG8    (TIM1_DMA1R,  0x52D3, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM1_CR1_CEN             TIM1_CR1_bit.CEN
#define TIM1_CR1_UDIS            TIM1_CR1_bit.UDIS
#define TIM1_CR1_URS             TIM1_CR1_bit.URS
#define TIM1_CR1_OPM             TIM1_CR1_bit.OPM
#define TIM1_CR1_DIR             TIM1_CR1_bit.DIR
#define TIM1_CR1_CMS             TIM1_CR1_bit.CMS
#define TIM1_CR1_ARPE            TIM1_CR1_bit.ARPE

#define TIM1_CR2_CCPC            TIM1_CR2_bit.CCPC
#define TIM1_CR2_COMS            TIM1_CR2_bit.COMS
#define TIM1_CR2_CCDS            TIM1_CR2_bit.CCDS
#define TIM1_CR2_MMS             TIM1_CR2_bit.MMS
#define TIM1_CR2_TI1S            TIM1_CR2_bit.TI1S

#define TIM1_SMCR_SMS            TIM1_SMCR_bit.SMS
#define TIM1_SMCR_OCCS           TIM1_SMCR_bit.OCCS
#define TIM1_SMCR_TS             TIM1_SMCR_bit.TS
#define TIM1_SMCR_MSM            TIM1_SMCR_bit.MSM

#define TIM1_ETR_ETF             TIM1_ETR_bit.ETF
#define TIM1_ETR_ETPS            TIM1_ETR_bit.ETPS
#define TIM1_ETR_ECE             TIM1_ETR_bit.ECE
#define TIM1_ETR_ETP             TIM1_ETR_bit.ETP

#define TIM1_DER_UDE             TIM1_DER_bit.UDE
#define TIM1_DER_CC1DE           TIM1_DER_bit.CC1DE
#define TIM1_DER_CC2DE           TIM1_DER_bit.CC2DE
#define TIM1_DER_CC3DE           TIM1_DER_bit.CC3DE
#define TIM1_DER_CC4DE           TIM1_DER_bit.CC4DE
#define TIM1_DER_COMDE           TIM1_DER_bit.COMDE

#define TIM1_IER_UIE             TIM1_IER_bit.UIE
#define TIM1_IER_CC1IE           TIM1_IER_bit.CC1IE
#define TIM1_IER_CC2IE           TIM1_IER_bit.CC2IE
#define TIM1_IER_CC3IE           TIM1_IER_bit.CC3IE
#define TIM1_IER_CC4IE           TIM1_IER_bit.CC4IE
#define TIM1_IER_COMIE           TIM1_IER_bit.COMIE
#define TIM1_IER_TIE             TIM1_IER_bit.TIE
#define TIM1_IER_BIE             TIM1_IER_bit.BIE

#define TIM1_SR1_UIF             TIM1_SR1_bit.UIF
#define TIM1_SR1_CC1IF           TIM1_SR1_bit.CC1IF
#define TIM1_SR1_CC2IF           TIM1_SR1_bit.CC2IF
#define TIM1_SR1_CC3IF           TIM1_SR1_bit.CC3IF
#define TIM1_SR1_CC4IF           TIM1_SR1_bit.CC4IF
#define TIM1_SR1_COMIF           TIM1_SR1_bit.COMIF
#define TIM1_SR1_TIF             TIM1_SR1_bit.TIF
#define TIM1_SR1_BIF             TIM1_SR1_bit.BIF

#define TIM1_SR2_CC1OF           TIM1_SR2_bit.CC1OF
#define TIM1_SR2_CC2OF           TIM1_SR2_bit.CC2OF
#define TIM1_SR2_CC3OF           TIM1_SR2_bit.CC3OF
#define TIM1_SR2_CC4OF           TIM1_SR2_bit.CC4OF

#define TIM1_EGR_UG              TIM1_EGR_bit.UG
#define TIM1_EGR_CC1G            TIM1_EGR_bit.CC1G
#define TIM1_EGR_CC2G            TIM1_EGR_bit.CC2G
#define TIM1_EGR_CC3G            TIM1_EGR_bit.CC3G
#define TIM1_EGR_CC4G            TIM1_EGR_bit.CC4G
#define TIM1_EGR_COMG            TIM1_EGR_bit.COMG
#define TIM1_EGR_TG              TIM1_EGR_bit.TG
#define TIM1_EGR_BG              TIM1_EGR_bit.BG

#define TIM1_CCMR1_CC1S          TIM1_CCMR1_bit.CC1S
#define TIM1_CCMR1_OC1FE         TIM1_CCMR1_bit.OC1FE
#define TIM1_CCMR1_OC1PE         TIM1_CCMR1_bit.OC1PE
#define TIM1_CCMR1_OC1M          TIM1_CCMR1_bit.OC1M
#define TIM1_CCMR1_OC1CE         TIM1_CCMR1_bit.OC1CE

#define TIM1_CCMR2_CC2S          TIM1_CCMR2_bit.CC2S
#define TIM1_CCMR2_OC2FE         TIM1_CCMR2_bit.OC2FE
#define TIM1_CCMR2_OC2PE         TIM1_CCMR2_bit.OC2PE
#define TIM1_CCMR2_OC2M          TIM1_CCMR2_bit.OC2M
#define TIM1_CCMR2_OC2CE         TIM1_CCMR2_bit.OC2CE

#define TIM1_CCMR3_CC3S          TIM1_CCMR3_bit.CC3S
#define TIM1_CCMR3_OC3FE         TIM1_CCMR3_bit.OC3FE
#define TIM1_CCMR3_OC3PE         TIM1_CCMR3_bit.OC3PE
#define TIM1_CCMR3_OC3M          TIM1_CCMR3_bit.OC3M
#define TIM1_CCMR3_OC3CE         TIM1_CCMR3_bit.OC3CE

#define TIM1_CCMR4_CC4S          TIM1_CCMR4_bit.CC4S
#define TIM1_CCMR4_OC4PE         TIM1_CCMR4_bit.OC4PE
#define TIM1_CCMR4_OC4M          TIM1_CCMR4_bit.OC4M
#define TIM1_CCMR4_OC4CE         TIM1_CCMR4_bit.OC4CE

#define TIM1_CCER1_CC1E          TIM1_CCER1_bit.CC1E
#define TIM1_CCER1_CC1P          TIM1_CCER1_bit.CC1P
#define TIM1_CCER1_CC1NE         TIM1_CCER1_bit.CC1NE
#define TIM1_CCER1_CC1NP         TIM1_CCER1_bit.CC1NP
#define TIM1_CCER1_CC2E          TIM1_CCER1_bit.CC2E
#define TIM1_CCER1_CC2P          TIM1_CCER1_bit.CC2P
#define TIM1_CCER1_CC2NE         TIM1_CCER1_bit.CC2NE
#define TIM1_CCER1_CC2NP         TIM1_CCER1_bit.CC2NP

