echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l152k4.h
#define TIM1_OISR_OIS1           TIM1_OISR_bit.OIS1
#define TIM1_OISR_OIS1N          TIM1_OISR_bit.OIS1N
#define TIM1_OISR_OIS2           TIM1_OISR_bit.OIS2
#define TIM1_OISR_OIS2N          TIM1_OISR_bit.OIS2N
#define TIM1_OISR_OIS3           TIM1_OISR_bit.OIS3
#define TIM1_OISR_OIS3N          TIM1_OISR_bit.OIS3N

#define TIM1_DCR1_DBA            TIM1_DCR1_bit.DBA

#define TIM1_DCR2_DBL            TIM1_DCR2_bit.DBL

#endif

/*-------------------------------------------------------------------------
 *      TIM1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM1_CR1_CEN        0x01
#define MASK_TIM1_CR1_UDIS       0x02
#define MASK_TIM1_CR1_URS        0x04
#define MASK_TIM1_CR1_OPM        0x08
#define MASK_TIM1_CR1_DIR        0x10
#define MASK_TIM1_CR1_CMS        0x60
#define MASK_TIM1_CR1_ARPE       0x80

#define MASK_TIM1_CR2_CCPC       0x01
#define MASK_TIM1_CR2_COMS       0x04
#define MASK_TIM1_CR2_CCDS       0x08
#define MASK_TIM1_CR2_MMS        0x70
#define MASK_TIM1_CR2_TI1S       0x80

#define MASK_TIM1_SMCR_SMS       0x07
#define MASK_TIM1_SMCR_OCCS      0x08
#define MASK_TIM1_SMCR_TS        0x70
#define MASK_TIM1_SMCR_MSM       0x80

#define MASK_TIM1_ETR_ETF        0x0F
#define MASK_TIM1_ETR_ETPS       0x30
#define MASK_TIM1_ETR_ECE        0x40
#define MASK_TIM1_ETR_ETP        0x80

#define MASK_TIM1_DER_UDE        0x01
#define MASK_TIM1_DER_CC1DE      0x02
#define MASK_TIM1_DER_CC2DE      0x04
#define MASK_TIM1_DER_CC3DE      0x08
#define MASK_TIM1_DER_CC4DE      0x10
#define MASK_TIM1_DER_COMDE      0x20

#define MASK_TIM1_IER_UIE        0x01
#define MASK_TIM1_IER_CC1IE      0x02
#define MASK_TIM1_IER_CC2IE      0x04
#define MASK_TIM1_IER_CC3IE      0x08
#define MASK_TIM1_IER_CC4IE      0x10
#define MASK_TIM1_IER_COMIE      0x20
#define MASK_TIM1_IER_TIE        0x40
#define MASK_TIM1_IER_BIE        0x80

#define MASK_TIM1_SR1_UIF        0x01
#define MASK_TIM1_SR1_CC1IF      0x02
#define MASK_TIM1_SR1_CC2IF      0x04
#define MASK_TIM1_SR1_CC3IF      0x08
#define MASK_TIM1_SR1_CC4IF      0x10
#define MASK_TIM1_SR1_COMIF      0x20
#define MASK_TIM1_SR1_TIF        0x40
#define MASK_TIM1_SR1_BIF        0x80

#define MASK_TIM1_SR2_CC1OF      0x02
#define MASK_TIM1_SR2_CC2OF      0x04
#define MASK_TIM1_SR2_CC3OF      0x08
#define MASK_TIM1_SR2_CC4OF      0x10

#define MASK_TIM1_EGR_UG         0x01
#define MASK_TIM1_EGR_CC1G       0x02
#define MASK_TIM1_EGR_CC2G       0x04
#define MASK_TIM1_EGR_CC3G       0x08
#define MASK_TIM1_EGR_CC4G       0x10
#define MASK_TIM1_EGR_COMG       0x20
#define MASK_TIM1_EGR_TG         0x40
#define MASK_TIM1_EGR_BG         0x80

#define MASK_TIM1_CCMR1_CC1S     0x03
#define MASK_TIM1_CCMR1_OC1FE    0x04
#define MASK_TIM1_CCMR1_OC1PE    0x08
#define MASK_TIM1_CCMR1_OC1M     0x70
#define MASK_TIM1_CCMR1_OC1CE    0x80

#define MASK_TIM1_CCMR2_CC2S     0x03
#define MASK_TIM1_CCMR2_OC2FE    0x04
#define MASK_TIM1_CCMR2_OC2PE    0x08
#define MASK_TIM1_CCMR2_OC2M     0x70
#define MASK_TIM1_CCMR2_OC2CE    0x80

#define MASK_TIM1_CCMR3_CC3S     0x03
#define MASK_TIM1_CCMR3_OC3FE    0x04
#define MASK_TIM1_CCMR3_OC3PE    0x08
#define MASK_TIM1_CCMR3_OC3M     0x70
#define MASK_TIM1_CCMR3_OC3CE    0x80

#define MASK_TIM1_CCMR4_CC4S     0x03
#define MASK_TIM1_CCMR4_OC4PE    0x08
#define MASK_TIM1_CCMR4_OC4M     0x70
#define MASK_TIM1_CCMR4_OC4CE    0x80

#define MASK_TIM1_CCER1_CC1E     0x01
#define MASK_TIM1_CCER1_CC1P     0x02
#define MASK_TIM1_CCER1_CC1NE    0x04
#define MASK_TIM1_CCER1_CC1NP    0x08
#define MASK_TIM1_CCER1_CC2E     0x10
#define MASK_TIM1_CCER1_CC2P     0x20
#define MASK_TIM1_CCER1_CC2NE    0x40
#define MASK_TIM1_CCER1_CC2NP    0x80

#define MASK_TIM1_CCER2_CC3E     0x01
#define MASK_TIM1_CCER2_CC3P     0x02
#define MASK_TIM1_CCER2_CC3NE    0x04
#define MASK_TIM1_CCER2_CC3NP    0x08
#define MASK_TIM1_CCER2_CC4E     0x10
#define MASK_TIM1_CCER2_CC4P     0x20

#define MASK_TIM1_CNTRH_CNT8     0x01
#define MASK_TIM1_CNTRH_CNT9     0x02
#define MASK_TIM1_CNTRH_CNT10    0x04
#define MASK_TIM1_CNTRH_CNT11    0x08
#define MASK_TIM1_CNTRH_CNT12    0x10
#define MASK_TIM1_CNTRH_CNT13    0x20
#define MASK_TIM1_CNTRH_CNT14    0x40
#define MASK_TIM1_CNTRH_CNT15    0x80

#define MASK_TIM1_CNTRL_CNT0     0x01
#define MASK_TIM1_CNTRL_CNT1     0x02
#define MASK_TIM1_CNTRL_CNT2     0x04
#define MASK_TIM1_CNTRL_CNT3     0x08
#define MASK_TIM1_CNTRL_CNT4     0x10
#define MASK_TIM1_CNTRL_CNT5     0x20
#define MASK_TIM1_CNTRL_CNT6     0x40
#define MASK_TIM1_CNTRL_CNT7     0x80

#define MASK_TIM1_PSCRH_PSC8     0x01
#define MASK_TIM1_PSCRH_PSC9     0x02
#define MASK_TIM1_PSCRH_PSC10    0x04
#define MASK_TIM1_PSCRH_PSC11    0x08
#define MASK_TIM1_PSCRH_PSC12    0x10
#define MASK_TIM1_PSCRH_PSC13    0x20
#define MASK_TIM1_PSCRH_PSC14    0x40
#define MASK_TIM1_PSCRH_PSC15    0x80

#define MASK_TIM1_PSCRL_PSC0     0x01
#define MASK_TIM1_PSCRL_PSC1     0x02
#define MASK_TIM1_PSCRL_PSC2     0x04
#define MASK_TIM1_PSCRL_PSC3     0x08
#define MASK_TIM1_PSCRL_PSC4     0x10
#define MASK_TIM1_PSCRL_PSC5     0x20
#define MASK_TIM1_PSCRL_PSC6     0x40
#define MASK_TIM1_PSCRL_PSC7     0x80

#define MASK_TIM1_ARRH_ARR8      0x01
#define MASK_TIM1_ARRH_ARR9      0x02
#define MASK_TIM1_ARRH_ARR10     0x04
#define MASK_TIM1_ARRH_ARR11     0x08
#define MASK_TIM1_ARRH_ARR12     0x10
#define MASK_TIM1_ARRH_ARR13     0x20
#define MASK_TIM1_ARRH_ARR14     0x40
#define MASK_TIM1_ARRH_ARR15     0x80

#define MASK_TIM1_ARRL_ARR0      0x01
#define MASK_TIM1_ARRL_ARR1      0x02
#define MASK_TIM1_ARRL_ARR2      0x04
#define MASK_TIM1_ARRL_ARR3      0x08
#define MASK_TIM1_ARRL_ARR4      0x10
#define MASK_TIM1_ARRL_ARR5      0x20
#define MASK_TIM1_ARRL_ARR6      0x40
#define MASK_TIM1_ARRL_ARR7      0x80

#define MASK_TIM1_CCR1H_CCR18    0x01
#define MASK_TIM1_CCR1H_CCR19    0x02
#define MASK_TIM1_CCR1H_CCR110   0x04
#define MASK_TIM1_CCR1H_CCR111   0x08
#define MASK_TIM1_CCR1H_CCR112   0x10
#define MASK_TIM1_CCR1H_CCR113   0x20
#define MASK_TIM1_CCR1H_CCR114   0x40
#define MASK_TIM1_CCR1H_CCR115   0x80

#define MASK_TIM1_CCR1L_CCR10    0x01
#define MASK_TIM1_CCR1L_CCR11    0x02
#define MASK_TIM1_CCR1L_CCR12    0x04
#define MASK_TIM1_CCR1L_CCR13    0x08
#define MASK_TIM1_CCR1L_CCR14    0x10
#define MASK_TIM1_CCR1L_CCR15    0x20
#define MASK_TIM1_CCR1L_CCR16    0x40
#define MASK_TIM1_CCR1L_CCR17    0x80

#define MASK_TIM1_CCR2H_CCR28    0x01
#define MASK_TIM1_CCR2H_CCR29    0x02
#define MASK_TIM1_CCR2H_CCR210   0x04
#define MASK_TIM1_CCR2H_CCR211   0x08
#define MASK_TIM1_CCR2H_CCR212   0x10
#define MASK_TIM1_CCR2H_CCR213   0x20
#define MASK_TIM1_CCR2H_CCR214   0x40
#define MASK_TIM1_CCR2H_CCR215   0x80

