echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l152k4.h
#define TIM4_SR1_UIF             TIM4_SR1_bit.UIF
#define TIM4_SR1_TIF             TIM4_SR1_bit.TIF

#define TIM4_EGR_UG              TIM4_EGR_bit.UG
#define TIM4_EGR_TG              TIM4_EGR_bit.TG

#define TIM4_CNTR_CNT0           TIM4_CNTR_bit.CNT0
#define TIM4_CNTR_CNT1           TIM4_CNTR_bit.CNT1
#define TIM4_CNTR_CNT2           TIM4_CNTR_bit.CNT2
#define TIM4_CNTR_CNT3           TIM4_CNTR_bit.CNT3
#define TIM4_CNTR_CNT4           TIM4_CNTR_bit.CNT4
#define TIM4_CNTR_CNT5           TIM4_CNTR_bit.CNT5
#define TIM4_CNTR_CNT6           TIM4_CNTR_bit.CNT6
#define TIM4_CNTR_CNT7           TIM4_CNTR_bit.CNT7

#define TIM4_PSCR_PSC            TIM4_PSCR_bit.PSC

#define TIM4_ARR_ARR0            TIM4_ARR_bit.ARR0
#define TIM4_ARR_ARR1            TIM4_ARR_bit.ARR1
#define TIM4_ARR_ARR2            TIM4_ARR_bit.ARR2
#define TIM4_ARR_ARR3            TIM4_ARR_bit.ARR3
#define TIM4_ARR_ARR4            TIM4_ARR_bit.ARR4
#define TIM4_ARR_ARR5            TIM4_ARR_bit.ARR5
#define TIM4_ARR_ARR6            TIM4_ARR_bit.ARR6
#define TIM4_ARR_ARR7            TIM4_ARR_bit.ARR7

#endif

/*-------------------------------------------------------------------------
 *      TIM4 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM4_CR1_CEN        0x01
#define MASK_TIM4_CR1_UDIS       0x02
#define MASK_TIM4_CR1_URS        0x04
#define MASK_TIM4_CR1_OPM        0x08
#define MASK_TIM4_CR1_ARPE       0x80

#define MASK_TIM4_CR2_MMS        0x70

#define MASK_TIM4_SMCR_SMS       0x07
#define MASK_TIM4_SMCR_TS        0x70
#define MASK_TIM4_SMCR_MSM       0x80

#define MASK_TIM4_DER_UDE        0x01

#define MASK_TIM4_IER_UIE        0x01
#define MASK_TIM4_IER_TIE        0x40

#define MASK_TIM4_SR1_UIF        0x01
#define MASK_TIM4_SR1_TIF        0x40

#define MASK_TIM4_EGR_UG         0x01
#define MASK_TIM4_EGR_TG         0x40

#define MASK_TIM4_CNTR_CNT0      0x01
#define MASK_TIM4_CNTR_CNT1      0x02
#define MASK_TIM4_CNTR_CNT2      0x04
#define MASK_TIM4_CNTR_CNT3      0x08
#define MASK_TIM4_CNTR_CNT4      0x10
#define MASK_TIM4_CNTR_CNT5      0x20
#define MASK_TIM4_CNTR_CNT6      0x40
#define MASK_TIM4_CNTR_CNT7      0x80

#define MASK_TIM4_PSCR_PSC       0x0F

#define MASK_TIM4_ARR_ARR0       0x01
#define MASK_TIM4_ARR_ARR1       0x02
#define MASK_TIM4_ARR_ARR2       0x04
#define MASK_TIM4_ARR_ARR3       0x08
#define MASK_TIM4_ARR_ARR4       0x10
#define MASK_TIM4_ARR_ARR5       0x20
#define MASK_TIM4_ARR_ARR6       0x40
#define MASK_TIM4_ARR_ARR7       0x80


/*-------------------------------------------------------------------------
 *      IRTIM register definitions
 *-----------------------------------------------------------------------*/
/* Infra-red control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IR_EN       : 1;
  unsigned char HS_EN       : 1;
} __BITS_IR_CR;
#endif
__IO_REG8_BIT(IR_CR,       0x52FF, __READ_WRITE, __BITS_IR_CR);


/*-------------------------------------------------------------------------
 *      IRTIM bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define IR_CR_IR_EN              IR_CR_bit.IR_EN
#define IR_CR_HS_EN              IR_CR_bit.HS_EN

#endif

/*-------------------------------------------------------------------------
 *      IRTIM bit masks
 *-----------------------------------------------------------------------*/
#define MASK_IR_CR_IR_EN         0x01
#define MASK_IR_CR_HS_EN         0x02


/*-------------------------------------------------------------------------
 *      ADC1 register definitions
 *-----------------------------------------------------------------------*/
/* ADC1 configuration register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADON        : 1;
  unsigned char START       : 1;
  unsigned char CONT        : 1;
  unsigned char EOCIE       : 1;
  unsigned char AWDIE       : 1;
  unsigned char RES         : 2;
  unsigned char OVERIE      : 1;
} __BITS_ADC1_CR1;
#endif
__IO_REG8_BIT(ADC1_CR1,    0x5340, __READ_WRITE, __BITS_ADC1_CR1);

/* ADC1 configuration register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMTP1       : 3;
  unsigned char EXTSEL0     : 1;
  unsigned char EXTSEL1     : 1;
  unsigned char TRIG_EDGE0  : 1;
  unsigned char TRIG_EDGE1  : 1;
  unsigned char PRESC       : 1;
} __BITS_ADC1_CR2;
#endif
__IO_REG8_BIT(ADC1_CR2,    0x5341, __READ_WRITE, __BITS_ADC1_CR2);

/* ADC1 configuration register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CHSEL       : 5;
  unsigned char SMTP2       : 3;
} __BITS_ADC1_CR3;
#endif
__IO_REG8_BIT(ADC1_CR3,    0x5342, __READ_WRITE, __BITS_ADC1_CR3);

/* ADC1 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EOC         : 1;
  unsigned char AWD         : 1;
  unsigned char OVER        : 1;
} __BITS_ADC1_SR;
#endif
__IO_REG8_BIT(ADC1_SR,     0x5343, __READ_WRITE, __BITS_ADC1_SR);

/* ADC1 data register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONV_DATA8  : 1;
  unsigned char CONV_DATA9  : 1;
  unsigned char CONV_DATA10 : 1;
  unsigned char CONV_DATA11 : 1;
} __BITS_ADC1_DRH;
#endif
__IO_REG8_BIT(ADC1_DRH,    0x5344, __READ, __BITS_ADC1_DRH);

/* ADC1 data register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONV_DATA0  : 1;
  unsigned char CONV_DATA1  : 1;
  unsigned char CONV_DATA2  : 1;
  unsigned char CONV_DATA3  : 1;
  unsigned char CONV_DATA4  : 1;
  unsigned char CONV_DATA5  : 1;
  unsigned char CONV_DATA6  : 1;
  unsigned char CONV_DATA7  : 1;
} __BITS_ADC1_DRL;
#endif
__IO_REG8_BIT(ADC1_DRL,    0x5345, __READ, __BITS_ADC1_DRL);

/* ADC1 high threshold register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HT8         : 1;
  unsigned char HT9         : 1;
  unsigned char HT10        : 1;
  unsigned char HT11        : 1;
} __BITS_ADC1_HTRH;
#endif
__IO_REG8_BIT(ADC1_HTRH,   0x5346, __READ_WRITE, __BITS_ADC1_HTRH);

/* ADC1 high threshold register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HT0         : 1;
  unsigned char HT1         : 1;
  unsigned char HT2         : 1;
  unsigned char HT3         : 1;
  unsigned char HT4         : 1;
  unsigned char HT5         : 1;
  unsigned char HT6         : 1;
  unsigned char HT7         : 1;
} __BITS_ADC1_HTRL;
#endif
__IO_REG8_BIT(ADC1_HTRL,   0x5347, __READ_WRITE, __BITS_ADC1_HTRL);

